Revit 2027 API
AssetPropertyEnum.Value Property
 The value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Value { get; set; }
Public Property Value As Integer
	Get
	Set
public:
property int Value {
	int get ();
	void set (int value);
}
member Value : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyEnum property.
InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
Reference
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace